# Show Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..Show Method
TaskDialog Class See Also
---
Shows the task dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TaskDialogResult Show()
```

Visual Basic
---
```text
Public Function Show As TaskDialogResult
```

Visual C++
---
```text
public:
TaskDialogResult Show()
```

# ### Return Value
The user's response to the task dialog.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the task dialog is shown out of main thread of Revit or when an extra checkbox and a verification checkbox are enabled at the same time. |

# See Also
TaskDialog Class
Show Overload
Autodesk.Revit.UI Namespace